CREATE TABLE IF NOT EXISTS district (
    id INT PRIMARY KEY,
    provinceid INT NOT NULL,
    district_title VARCHAR(255) NOT NULL,
    district_title_nepali VARCHAR(255) NOT NULL,
    code INT NOT NULL
);

INSERT INTO district(id,provinceid,district_title,district_title_nepali,code)
VALUES (
        1,
        1,
        'Taplejung',
        'ताप्लेजुङ',
        101
    ), (
        2,
        1,
        'Sankhuwasabha',
        'संखुवासभा',
        102
    ), (
        3,
        1,
        'Solukhumbu',
        'सोलुखुम्बु',
        103
    ), (
        4,
        1,
        'Okhaldhunga',
        'ओखलढुङ्गा',
        104
    ), (5, 1, 'Khotang', 'खोटाङ', 105), (6, 1, 'Bhojpur', 'भोजपुर', 106), (7, 1, 'Dhankuta', 'धनकुटा', 107), (
        8,
        1,
        'Tehrathum',
        'तेह्रथुम',
        108
    ), (9, 1, 'Panchthar', 'पाँचथर', 109), (10, 1, 'Ilam', 'इलाम', 110), (11, 1, 'Jhapa', 'झापा', 111), (12, 1, 'Morang', 'मोरङ', 112), (13, 1, 'Sunsari', 'सुनसरी', 113), (14, 1, 'Udayapur', 'उदयपुर', 114), (15, 2, 'Saptari', 'सप्तरी', 201), (16, 2, 'Siraha', 'सिरहा', 202), (17, 2, 'Dhanusa', 'धनुषा', 203), (
        18,
        2,
        'Mahottari',
        'महोत्तरी',
        204
    ), (19, 2, 'Sarlahi', 'सर्लाही', 205), (20, 2, 'Rautahat', 'रौतहट', 206), (21, 2, 'Bara', 'बारा', 207), (22, 2, 'Parsa', 'पर्सा', 208), (23, 3, 'Dolakha', 'दोलखा', 301), (
        24,
        3,
        'Sindhupalchok',
        'सिन्धुपाल्चोक',
        302
    ), (25, 3, 'Rasuwa', 'रसुवा', 303), (26, 3, 'Dhading', 'धादिङ', 304), (27, 3, 'Nuwakot', 'नुवाकोट', 305), (
        28,
        3,
        'Kathmandu',
        'काठमाडौँ',
        306
    ), (
        29,
        3,
        'Bhaktapur',
        'भक्तपुर',
        307
    ), (
        30,
        3,
        'Lalitpur',
        'ललितपुर',
        308
    ), (
        31,
        3,
        'Kavrepalanchok',
        'काभ्रेपलाञ्चोक',
        309
    ), (
        32,
        3,
        'Ramechhap',
        'रामेछाप',
        310
    ), (
        33,
        3,
        'Sindhuli',
        'सिन्धुली',
        311
    ), (
        34,
        3,
        'Makwanpur',
        'मकवानपुर',
        312
    ), (35, 3, 'Chitwan', 'चितवन', 313), (36, 4, 'Gorkha', 'गोरखा', 401), (37, 4, 'Manang', 'मनाङ', 402), (38, 4, 'Mustang', 'मुस्ताङ', 403), (39, 4, 'Myagdi', 'म्याग्दी', 404), (40, 4, 'Kaski', 'कास्की', 405), (41, 4, 'Lamjung', 'लमजुङ', 406), (42, 4, 'Tanahun', 'तनहुँ', 407), (
        43,
        4,
        'Nawalparasi East',
        'नवलपरासी पूर्व',
        408
    ), (44, 4, 'Syangja', 'स्याङजा', 409), (45, 4, 'Parbat', 'पर्वत', 410), (46, 4, 'Baglung', 'बागलुङ', 411), (
        47,
        5,
        'Rukum East',
        'रुकुम पूर्व',
        501
    ), (48, 5, 'Rolpa', 'रोल्पा', 502), (49, 5, 'Pyuthan', 'प्यूठान', 503), (50, 5, 'Gulmi', 'गुल्मी', 504), (
        51,
        5,
        'Arghakhanchi',
        'अर्घाखाँची',
        505
    ), (52, 5, 'Palpa', 'पाल्पा', 506), (
        53,
        5,
        'Nawalparasi West',
        'नवलपरासी पश्चिम',
        507
    ), (
        54,
        5,
        'Rupandehi',
        'रुपन्देही',
        508
    ), (
        55,
        5,
        'Kapilbastu',
        'कपिलवस्तु',
        509
    ), (56, 5, 'Dang', 'दाङ', 510), (57, 5, 'Banke', 'बाँके', 511), (58, 5, 'Bardiya', 'बर्दिया', 512), (59, 6, 'Dolpa', 'डोल्पा', 601), (60, 6, 'Mugu', 'मुगु', 602), (61, 6, 'Humla', 'हुम्ला', 603), (62, 6, 'Jumla', 'जुम्ला', 604), (63, 6, 'Kalikot', 'कालिकोट', 605), (64, 6, 'Dailekh', 'दैलेख', 606), (
        65,
        6,
        'Jajarkot',
        'जाजरकोट',
        607
    ), (
        66,
        6,
        'Rukum West',
        'रुकुम पश्चिम',
        608
    ), (67, 6, 'Salyan', 'सल्यान', 609), (68, 6, 'Surkhet', 'सुर्खेत', 610), (69, 7, 'Bajura', 'बाजुरा', 701), (70, 7, 'Bajhang', 'बझाङ', 702), (
        71,
        7,
        'Darchula',
        'दार्चुला',
        703
    ), (72, 7, 'Baitadi', 'बैतडी', 704), (
        73,
        7,
        'Dandeldhura',
        'डँडेलधुरा',
        705
    ), (74, 7, 'Doti', 'डोटी', 706), (75, 7, 'Achham', 'अछाम', 707), (76, 7, 'Kailali', 'कैलाली', 708), (
        77,
        7,
        'Kanchanpur',
        'कञ्चनपुर',
        709
    );